export default function MySoulPage() {
  const render3000LoveTitle = () => {
    return (
      <div class="sticky top-0 bg-white z-2 p-16px text-14px font-600">
        3000 Love 💐
      </div>
    );
  };

  const rener3000LoveMain = () => {
    return (
      <div class="p-16px pt-0 line-height-22px">
        <p>
          经常想，我的努力是为了什么，我想要赚钱，想要变得更优秀是为了什么？一遍一遍的没有答案，一遍一遍的模糊，到一遍一遍的清晰，一开始我以为是为了那些我爱的人，爱我的人，
        </p>
        <p>是希望他们可以过上想要的生活，</p>
        <p>是希望他们可以健康，快乐，幸福，</p>

        <p>是希望他们可以做理想的自己，</p>

        <p>是希望他们可以不受世俗眼光去做事情，</p>

        <p>是希望他们可以保持单纯，保持可爱，</p>
        <p>是希望他们可以想买什么就买什么，想吃什么就吃什么，想去哪就去哪，</p>
        <p>是希望他们可以不用勉强融入别人的生活，</p>
        <p>是希望他们可以不用看人眼色，</p>
        <p> 是希望他们可以不想做什么就不做什么...</p>
        <p>
          读了一些书，看了一些电影，感受一些生活，去思考去沉淀，慢慢地也更加清晰和坚定...
        </p>
        <p>
          我知道了，是为了我自己可以过上想要的生活，是为了我自己可以快乐，是为了我自己可以幸福，是为了我自己可以健康，是为了我自己可以更理想地做自己...
        </p>
        <p>只有基于此，我才能实现我对他们的理想...</p>
        <p>希望如此，希望成真</p>
        <p>
          生活中，遇到种种困难，遇到种种人性的弱点，贪婪，懒惰，易怒，也不安，也烦躁，也会情绪不稳定...
        </p>
        <p>
          但凡动摇与偏激，都不是我所本意，我应更理想，应让自己情绪更稳定，让自己行为更坚定，让自己内心深处更平静...
        </p>

        <p>那些可爱的人儿啊 ~ 我爱你们 💐</p>
        <p>
          我愿用我所有所有所有换取你们一辈子健康，快乐，幸福，愿你们每一辈子都健康，快乐，幸福
          💐
        </p>
      </div>
    );
  };

  return (
    <div class="h-100% w-100% text-12px">
      {render3000LoveTitle()}
      {rener3000LoveMain()}
    </div>
  );
}

MySoulPage.displayName = "MySoulPage";
